/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const _POSIX_TRACE_LOG: i32 = -1;
pub const _POSIX_TYPED_MEMORY_OBJECTS: i32 = -1;
pub const _POSIX_V7_ILP32_OFF32: i32 = -1;
pub const _POSIX_V7_ILP32_OFFBIG: i32 = -1;
pub const _POSIX_V6_ILP32_OFF32: i32 = -1;
pub const _POSIX_V6_ILP32_OFFBIG: i32 = -1;
pub const _XBS5_ILP32_OFF32: i32 = -1;
pub const _XBS5_ILP32_OFFBIG: i32 = -1;
pub const _POSIX_V7_LPBIG_OFFBIG: i32 = -1;
pub const _POSIX_V6_LPBIG_OFFBIG: i32 = -1;
pub const _XBS5_LPBIG_OFFBIG: i32 = -1;
pub const _POSIX_V7_LP64_OFF64: u32 = 1;
pub const _POSIX_V6_LP64_OFF64: u32 = 1;
pub const _XBS5_LP64_OFF64: u32 = 1;
pub const STDIN_FILENO: u32 = 0;
pub const STDOUT_FILENO: u32 = 1;
pub const STDERR_FILENO: u32 = 2;
pub const L_SET: u32 = 0;
pub const L_INCR: u32 = 1;
pub const L_XTND: u32 = 2;
pub const _GETOPT_POSIX_H: u32 = 1;
pub const _UTIME_H: u32 = 1;
pub const _UTMPX_H: u32 = 1;
pub const __UT_LINESIZE: u32 = 32;
pub const __UT_NAMESIZE: u32 = 32;
pub const __UT_HOSTSIZE: u32 = 256;
pub const _VALUES_H: u32 = 1;
pub const _SYS_WAIT_H: u32 = 1;
pub const WCOREFLAG: u32 = 128;
pub const WAIT_ANY: i32 = -1;
pub const WAIT_MYPGRP: u32 = 0;
pub const _WORDEXP_H: u32 = 1;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_int;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_slist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_int,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __pad1: ::std::os::raw::c_ulong,
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_rwlock_arch_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    const UNINIT: ::std::mem::MaybeUninit<__once_flag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 64usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_sigval() {
    const UNINIT: ::std::mem::MaybeUninit<sigval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigval>(),
        8usize,
        concat!("Size of: ", stringify!(sigval))
    );
    assert_eq!(
        ::std::mem::align_of::<sigval>(),
        8usize,
        concat!("Alignment of ", stringify!(sigval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sival_int) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigval),
            "::",
            stringify!(sival_int)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sival_ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigval),
            "::",
            stringify!(sival_ptr)
        )
    );
}
pub type __sigval_t = sigval;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent {
    pub sigev_value: __sigval_t,
    pub sigev_signo: ::std::os::raw::c_int,
    pub sigev_notify: ::std::os::raw::c_int,
    pub _sigev_un: sigevent__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigevent__bindgen_ty_1 {
    pub _pad: [::std::os::raw::c_int; 12usize],
    pub _tid: __pid_t,
    pub _sigev_thread: sigevent__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent__bindgen_ty_1__bindgen_ty_1 {
    pub _function: ::std::option::Option<unsafe extern "C" fn(arg1: __sigval_t)>,
    pub _attribute: *mut pthread_attr_t,
}
#[test]
fn bindgen_test_layout_sigevent__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<sigevent__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigevent__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(sigevent__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<sigevent__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(sigevent__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._function) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_function)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._attribute) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_attribute)
        )
    );
}
#[test]
fn bindgen_test_layout_sigevent__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<sigevent__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigevent__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(sigevent__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<sigevent__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(sigevent__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1),
            "::",
            stringify!(_pad)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._tid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1),
            "::",
            stringify!(_tid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sigev_thread) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent__bindgen_ty_1),
            "::",
            stringify!(_sigev_thread)
        )
    );
}
#[test]
fn bindgen_test_layout_sigevent() {
    const UNINIT: ::std::mem::MaybeUninit<sigevent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigevent>(),
        64usize,
        concat!("Size of: ", stringify!(sigevent))
    );
    assert_eq!(
        ::std::mem::align_of::<sigevent>(),
        8usize,
        concat!("Alignment of ", stringify!(sigevent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sigev_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent),
            "::",
            stringify!(sigev_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sigev_signo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent),
            "::",
            stringify!(sigev_signo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sigev_notify) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent),
            "::",
            stringify!(sigev_notify)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sigev_un) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sigevent),
            "::",
            stringify!(_sigev_un)
        )
    );
}
pub type sigevent_t = sigevent;
pub const SIGEV_SIGNAL: _bindgen_ty_1 = 0;
pub const SIGEV_NONE: _bindgen_ty_1 = 1;
pub const SIGEV_THREAD: _bindgen_ty_1 = 2;
pub const SIGEV_THREAD_ID: _bindgen_ty_1 = 4;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
pub struct aiocb {
    pub aio_fildes: ::std::os::raw::c_int,
    pub aio_lio_opcode: ::std::os::raw::c_int,
    pub aio_reqprio: ::std::os::raw::c_int,
    pub aio_buf: *mut ::std::os::raw::c_void,
    pub aio_nbytes: usize,
    pub aio_sigevent: sigevent,
    pub __next_prio: *mut aiocb,
    pub __abs_prio: ::std::os::raw::c_int,
    pub __policy: ::std::os::raw::c_int,
    pub __error_code: ::std::os::raw::c_int,
    pub __return_value: __ssize_t,
    pub aio_offset: __off_t,
    pub __pad: __IncompleteArrayField<::std::os::raw::c_char>,
    pub __glibc_reserved: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_aiocb() {
    const UNINIT: ::std::mem::MaybeUninit<aiocb> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aiocb>(),
        168usize,
        concat!("Size of: ", stringify!(aiocb))
    );
    assert_eq!(
        ::std::mem::align_of::<aiocb>(),
        8usize,
        concat!("Alignment of ", stringify!(aiocb))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aio_fildes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(aio_fildes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aio_lio_opcode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(aio_lio_opcode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aio_reqprio) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(aio_reqprio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aio_buf) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(aio_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aio_nbytes) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(aio_nbytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aio_sigevent) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(aio_sigevent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next_prio) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(__next_prio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__abs_prio) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(__abs_prio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__policy) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(__policy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__error_code) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(__error_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__return_value) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(__return_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aio_offset) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(aio_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(__pad)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__glibc_reserved) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(aiocb),
            "::",
            stringify!(__glibc_reserved)
        )
    );
}
pub const AIO_CANCELED: _bindgen_ty_2 = 0;
pub const AIO_NOTCANCELED: _bindgen_ty_2 = 1;
pub const AIO_ALLDONE: _bindgen_ty_2 = 2;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const LIO_READ: _bindgen_ty_3 = 0;
pub const LIO_WRITE: _bindgen_ty_3 = 1;
pub const LIO_NOP: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const LIO_WAIT: _bindgen_ty_4 = 0;
pub const LIO_NOWAIT: _bindgen_ty_4 = 1;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aliasent {
    pub alias_name: *mut ::std::os::raw::c_char,
    pub alias_members_len: usize,
    pub alias_members: *mut *mut ::std::os::raw::c_char,
    pub alias_local: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_aliasent() {
    const UNINIT: ::std::mem::MaybeUninit<aliasent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aliasent>(),
        32usize,
        concat!("Size of: ", stringify!(aliasent))
    );
    assert_eq!(
        ::std::mem::align_of::<aliasent>(),
        8usize,
        concat!("Alignment of ", stringify!(aliasent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alias_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aliasent),
            "::",
            stringify!(alias_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alias_members_len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aliasent),
            "::",
            stringify!(alias_members_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alias_members) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aliasent),
            "::",
            stringify!(alias_members)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alias_local) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aliasent),
            "::",
            stringify!(alias_local)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ar_hdr {
    pub ar_name: [::std::os::raw::c_char; 16usize],
    pub ar_date: [::std::os::raw::c_char; 12usize],
    pub ar_uid: [::std::os::raw::c_char; 6usize],
    pub ar_gid: [::std::os::raw::c_char; 6usize],
    pub ar_mode: [::std::os::raw::c_char; 8usize],
    pub ar_size: [::std::os::raw::c_char; 10usize],
    pub ar_fmag: [::std::os::raw::c_char; 2usize],
}
#[test]
fn bindgen_test_layout_ar_hdr() {
    const UNINIT: ::std::mem::MaybeUninit<ar_hdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ar_hdr>(),
        60usize,
        concat!("Size of: ", stringify!(ar_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<ar_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(ar_hdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ar_hdr),
            "::",
            stringify!(ar_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_date) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ar_hdr),
            "::",
            stringify!(ar_date)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_uid) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ar_hdr),
            "::",
            stringify!(ar_uid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_gid) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(ar_hdr),
            "::",
            stringify!(ar_gid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_mode) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ar_hdr),
            "::",
            stringify!(ar_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ar_hdr),
            "::",
            stringify!(ar_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ar_fmag) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(ar_hdr),
            "::",
            stringify!(ar_fmag)
        )
    );
}
pub type __gnuc_va_list = [u64; 4usize];
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[test]
fn bindgen_test_layout__IO_cookie_io_functions_t() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_cookie_io_functions_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_cookie_io_functions_t>(),
        32usize,
        concat!("Size of: ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_cookie_io_functions_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(close)
        )
    );
}
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type va_list = __gnuc_va_list;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
pub type _Float128 = u128;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
pub const _ISupper: _bindgen_ty_5 = 256;
pub const _ISlower: _bindgen_ty_5 = 512;
pub const _ISalpha: _bindgen_ty_5 = 1024;
pub const _ISdigit: _bindgen_ty_5 = 2048;
pub const _ISxdigit: _bindgen_ty_5 = 4096;
pub const _ISspace: _bindgen_ty_5 = 8192;
pub const _ISprint: _bindgen_ty_5 = 16384;
pub const _ISgraph: _bindgen_ty_5 = 32768;
pub const _ISblank: _bindgen_ty_5 = 1;
pub const _IScntrl: _bindgen_ty_5 = 2;
pub const _ISpunct: _bindgen_ty_5 = 4;
pub const _ISalnum: _bindgen_ty_5 = 8;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct option {
    pub name: *const ::std::os::raw::c_char,
    pub has_arg: ::std::os::raw::c_int,
    pub flag: *mut ::std::os::raw::c_int,
    pub val: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_option() {
    const UNINIT: ::std::mem::MaybeUninit<option> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<option>(),
        32usize,
        concat!("Size of: ", stringify!(option))
    );
    assert_eq!(
        ::std::mem::align_of::<option>(),
        8usize,
        concat!("Alignment of ", stringify!(option))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(option),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(option),
            "::",
            stringify!(has_arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(option),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(option),
            "::",
            stringify!(val)
        )
    );
}
pub type error_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct argp_option {
    pub name: *const ::std::os::raw::c_char,
    pub key: ::std::os::raw::c_int,
    pub arg: *const ::std::os::raw::c_char,
    pub flags: ::std::os::raw::c_int,
    pub doc: *const ::std::os::raw::c_char,
    pub group: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_argp_option() {
    const UNINIT: ::std::mem::MaybeUninit<argp_option> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<argp_option>(),
        48usize,
        concat!("Size of: ", stringify!(argp_option))
    );
    assert_eq!(
        ::std::mem::align_of::<argp_option>(),
        8usize,
        concat!("Alignment of ", stringify!(argp_option))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_option),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_option),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_option),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_option),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).doc) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_option),
            "::",
            stringify!(doc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_option),
            "::",
            stringify!(group)
        )
    );
}
pub type argp_parser_t = ::std::option::Option<
    unsafe extern "C" fn(
        __key: ::std::os::raw::c_int,
        __arg: *mut ::std::os::raw::c_char,
        __state: *mut argp_state,
    ) -> error_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct argp {
    pub options: *const argp_option,
    pub parser: argp_parser_t,
    pub args_doc: *const ::std::os::raw::c_char,
    pub doc: *const ::std::os::raw::c_char,
    pub children: *const argp_child,
    pub help_filter: ::std::option::Option<
        unsafe extern "C" fn(
            __key: ::std::os::raw::c_int,
            __text: *const ::std::os::raw::c_char,
            __input: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub argp_domain: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_argp() {
    const UNINIT: ::std::mem::MaybeUninit<argp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<argp>(),
        56usize,
        concat!("Size of: ", stringify!(argp))
    );
    assert_eq!(
        ::std::mem::align_of::<argp>(),
        8usize,
        concat!("Alignment of ", stringify!(argp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(argp),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parser) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(argp),
            "::",
            stringify!(parser)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).args_doc) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(argp),
            "::",
            stringify!(args_doc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).doc) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(argp), "::", stringify!(doc))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).children) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(argp),
            "::",
            stringify!(children)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).help_filter) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(argp),
            "::",
            stringify!(help_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argp_domain) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(argp),
            "::",
            stringify!(argp_domain)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct argp_child {
    pub argp: *const argp,
    pub flags: ::std::os::raw::c_int,
    pub header: *const ::std::os::raw::c_char,
    pub group: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_argp_child() {
    const UNINIT: ::std::mem::MaybeUninit<argp_child> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<argp_child>(),
        32usize,
        concat!("Size of: ", stringify!(argp_child))
    );
    assert_eq!(
        ::std::mem::align_of::<argp_child>(),
        8usize,
        concat!("Alignment of ", stringify!(argp_child))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_child),
            "::",
            stringify!(argp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_child),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_child),
            "::",
            stringify!(header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_child),
            "::",
            stringify!(group)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct argp_state {
    pub root_argp: *const argp,
    pub argc: ::std::os::raw::c_int,
    pub argv: *mut *mut ::std::os::raw::c_char,
    pub next: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_uint,
    pub arg_num: ::std::os::raw::c_uint,
    pub quoted: ::std::os::raw::c_int,
    pub input: *mut ::std::os::raw::c_void,
    pub child_inputs: *mut *mut ::std::os::raw::c_void,
    pub hook: *mut ::std::os::raw::c_void,
    pub name: *mut ::std::os::raw::c_char,
    pub err_stream: *mut FILE,
    pub out_stream: *mut FILE,
    pub pstate: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_argp_state() {
    const UNINIT: ::std::mem::MaybeUninit<argp_state> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<argp_state>(),
        96usize,
        concat!("Size of: ", stringify!(argp_state))
    );
    assert_eq!(
        ::std::mem::align_of::<argp_state>(),
        8usize,
        concat!("Alignment of ", stringify!(argp_state))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).root_argp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(root_argp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(argc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argv) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(argv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arg_num) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(arg_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quoted) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(quoted)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).input) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(input)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).child_inputs) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(child_inputs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hook) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(hook)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).err_stream) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(err_stream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).out_stream) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(out_stream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pstate) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(argp_state),
            "::",
            stringify!(pstate)
        )
    );
}
extern "C" {
    pub static mut argp_program_version: *const ::std::os::raw::c_char;
}
extern "C" {
    pub static mut argp_program_version_hook:
        ::std::option::Option<unsafe extern "C" fn(__stream: *mut FILE, __state: *mut argp_state)>;
}
extern "C" {
    pub static mut argp_program_bug_address: *const ::std::os::raw::c_char;
}
extern "C" {
    pub static mut argp_err_exit_status: error_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct crypt_data {
    pub output: [::std::os::raw::c_char; 384usize],
    pub setting: [::std::os::raw::c_char; 384usize],
    pub input: [::std::os::raw::c_char; 512usize],
    pub reserved: [::std::os::raw::c_char; 767usize],
    pub initialized: ::std::os::raw::c_char,
    pub internal: [::std::os::raw::c_char; 30720usize],
}
#[test]
fn bindgen_test_layout_crypt_data() {
    const UNINIT: ::std::mem::MaybeUninit<crypt_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<crypt_data>(),
        32768usize,
        concat!("Size of: ", stringify!(crypt_data))
    );
    assert_eq!(
        ::std::mem::align_of::<crypt_data>(),
        1usize,
        concat!("Alignment of ", stringify!(crypt_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).output) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(crypt_data),
            "::",
            stringify!(output)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setting) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(crypt_data),
            "::",
            stringify!(setting)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).input) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(crypt_data),
            "::",
            stringify!(input)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        1280usize,
        concat!(
            "Offset of field: ",
            stringify!(crypt_data),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialized) as usize - ptr as usize },
        2047usize,
        concat!(
            "Offset of field: ",
            stringify!(crypt_data),
            "::",
            stringify!(initialized)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).internal) as usize - ptr as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(crypt_data),
            "::",
            stringify!(internal)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dirent {
    pub d_ino: __ino_t,
    pub d_off: __off_t,
    pub d_reclen: ::std::os::raw::c_ushort,
    pub d_type: ::std::os::raw::c_uchar,
    pub d_name: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_dirent() {
    const UNINIT: ::std::mem::MaybeUninit<dirent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dirent>(),
        280usize,
        concat!("Size of: ", stringify!(dirent))
    );
    assert_eq!(
        ::std::mem::align_of::<dirent>(),
        8usize,
        concat!("Alignment of ", stringify!(dirent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_ino) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_off) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_off)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_reclen) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_reclen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_type) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_name) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(dirent),
            "::",
            stringify!(d_name)
        )
    );
}
pub const DT_UNKNOWN: _bindgen_ty_6 = 0;
pub const DT_FIFO: _bindgen_ty_6 = 1;
pub const DT_CHR: _bindgen_ty_6 = 2;
pub const DT_DIR: _bindgen_ty_6 = 4;
pub const DT_BLK: _bindgen_ty_6 = 6;
pub const DT_REG: _bindgen_ty_6 = 8;
pub const DT_LNK: _bindgen_ty_6 = 10;
pub const DT_SOCK: _bindgen_ty_6 = 12;
pub const DT_WHT: _bindgen_ty_6 = 14;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dirstream {
    _unused: [u8; 0],
}
pub type DIR = __dirstream;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type Elf32_Half = u16;
pub type Elf64_Half = u16;
pub type Elf32_Word = u32;
pub type Elf32_Sword = i32;
pub type Elf64_Word = u32;
pub type Elf64_Sword = i32;
pub type Elf32_Xword = u64;
pub type Elf32_Sxword = i64;
pub type Elf64_Xword = u64;
pub type Elf64_Sxword = i64;
pub type Elf32_Addr = u32;
pub type Elf64_Addr = u64;
pub type Elf32_Off = u32;
pub type Elf64_Off = u64;
pub type Elf32_Section = u16;
pub type Elf64_Section = u16;
pub type Elf32_Versym = Elf32_Half;
pub type Elf64_Versym = Elf64_Half;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Ehdr {
    pub e_ident: [::std::os::raw::c_uchar; 16usize],
    pub e_type: Elf32_Half,
    pub e_machine: Elf32_Half,
    pub e_version: Elf32_Word,
    pub e_entry: Elf32_Addr,
    pub e_phoff: Elf32_Off,
    pub e_shoff: Elf32_Off,
    pub e_flags: Elf32_Word,
    pub e_ehsize: Elf32_Half,
    pub e_phentsize: Elf32_Half,
    pub e_phnum: Elf32_Half,
    pub e_shentsize: Elf32_Half,
    pub e_shnum: Elf32_Half,
    pub e_shstrndx: Elf32_Half,
}
#[test]
fn bindgen_test_layout_Elf32_Ehdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Ehdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Ehdr>(),
        52usize,
        concat!("Size of: ", stringify!(Elf32_Ehdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Ehdr>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Ehdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_ident) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_ident)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_type) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_machine) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_version) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_entry) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_entry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_phoff) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_phoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_shoff) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_shoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_flags) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_ehsize) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_ehsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_phentsize) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_phentsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_phnum) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_phnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_shentsize) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_shentsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_shnum) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_shnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_shstrndx) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Ehdr),
            "::",
            stringify!(e_shstrndx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Ehdr {
    pub e_ident: [::std::os::raw::c_uchar; 16usize],
    pub e_type: Elf64_Half,
    pub e_machine: Elf64_Half,
    pub e_version: Elf64_Word,
    pub e_entry: Elf64_Addr,
    pub e_phoff: Elf64_Off,
    pub e_shoff: Elf64_Off,
    pub e_flags: Elf64_Word,
    pub e_ehsize: Elf64_Half,
    pub e_phentsize: Elf64_Half,
    pub e_phnum: Elf64_Half,
    pub e_shentsize: Elf64_Half,
    pub e_shnum: Elf64_Half,
    pub e_shstrndx: Elf64_Half,
}
#[test]
fn bindgen_test_layout_Elf64_Ehdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Ehdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Ehdr>(),
        64usize,
        concat!("Size of: ", stringify!(Elf64_Ehdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Ehdr>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Ehdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_ident) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_ident)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_type) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_machine) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_version) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_entry) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_entry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_phoff) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_phoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_shoff) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_shoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_ehsize) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_ehsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_phentsize) as usize - ptr as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_phentsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_phnum) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_phnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_shentsize) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_shentsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_shnum) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_shnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_shstrndx) as usize - ptr as usize },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Ehdr),
            "::",
            stringify!(e_shstrndx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Shdr {
    pub sh_name: Elf32_Word,
    pub sh_type: Elf32_Word,
    pub sh_flags: Elf32_Word,
    pub sh_addr: Elf32_Addr,
    pub sh_offset: Elf32_Off,
    pub sh_size: Elf32_Word,
    pub sh_link: Elf32_Word,
    pub sh_info: Elf32_Word,
    pub sh_addralign: Elf32_Word,
    pub sh_entsize: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Shdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Shdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Shdr>(),
        40usize,
        concat!("Size of: ", stringify!(Elf32_Shdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Shdr>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Shdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_addr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_offset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_size) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_link) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_link)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_info) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_addralign) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_addralign)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_entsize) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Shdr),
            "::",
            stringify!(sh_entsize)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Shdr {
    pub sh_name: Elf64_Word,
    pub sh_type: Elf64_Word,
    pub sh_flags: Elf64_Xword,
    pub sh_addr: Elf64_Addr,
    pub sh_offset: Elf64_Off,
    pub sh_size: Elf64_Xword,
    pub sh_link: Elf64_Word,
    pub sh_info: Elf64_Word,
    pub sh_addralign: Elf64_Xword,
    pub sh_entsize: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Shdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Shdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Shdr>(),
        64usize,
        concat!("Size of: ", stringify!(Elf64_Shdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Shdr>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Shdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_addr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_offset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_link) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_link)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_info) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_addralign) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_addralign)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sh_entsize) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Shdr),
            "::",
            stringify!(sh_entsize)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Chdr {
    pub ch_type: Elf32_Word,
    pub ch_size: Elf32_Word,
    pub ch_addralign: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Chdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Chdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Chdr>(),
        12usize,
        concat!("Size of: ", stringify!(Elf32_Chdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Chdr>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Chdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ch_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Chdr),
            "::",
            stringify!(ch_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ch_size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Chdr),
            "::",
            stringify!(ch_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ch_addralign) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Chdr),
            "::",
            stringify!(ch_addralign)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Chdr {
    pub ch_type: Elf64_Word,
    pub ch_reserved: Elf64_Word,
    pub ch_size: Elf64_Xword,
    pub ch_addralign: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Chdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Chdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Chdr>(),
        24usize,
        concat!("Size of: ", stringify!(Elf64_Chdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Chdr>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Chdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ch_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Chdr),
            "::",
            stringify!(ch_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ch_reserved) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Chdr),
            "::",
            stringify!(ch_reserved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ch_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Chdr),
            "::",
            stringify!(ch_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ch_addralign) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Chdr),
            "::",
            stringify!(ch_addralign)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Sym {
    pub st_name: Elf32_Word,
    pub st_value: Elf32_Addr,
    pub st_size: Elf32_Word,
    pub st_info: ::std::os::raw::c_uchar,
    pub st_other: ::std::os::raw::c_uchar,
    pub st_shndx: Elf32_Section,
}
#[test]
fn bindgen_test_layout_Elf32_Sym() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Sym> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Sym>(),
        16usize,
        concat!("Size of: ", stringify!(Elf32_Sym))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Sym>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Sym))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Sym),
            "::",
            stringify!(st_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Sym),
            "::",
            stringify!(st_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Sym),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_info) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Sym),
            "::",
            stringify!(st_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_other) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Sym),
            "::",
            stringify!(st_other)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_shndx) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Sym),
            "::",
            stringify!(st_shndx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Sym {
    pub st_name: Elf64_Word,
    pub st_info: ::std::os::raw::c_uchar,
    pub st_other: ::std::os::raw::c_uchar,
    pub st_shndx: Elf64_Section,
    pub st_value: Elf64_Addr,
    pub st_size: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Sym() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Sym> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Sym>(),
        24usize,
        concat!("Size of: ", stringify!(Elf64_Sym))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Sym>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Sym))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Sym),
            "::",
            stringify!(st_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_info) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Sym),
            "::",
            stringify!(st_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_other) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Sym),
            "::",
            stringify!(st_other)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_shndx) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Sym),
            "::",
            stringify!(st_shndx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Sym),
            "::",
            stringify!(st_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Sym),
            "::",
            stringify!(st_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Syminfo {
    pub si_boundto: Elf32_Half,
    pub si_flags: Elf32_Half,
}
#[test]
fn bindgen_test_layout_Elf32_Syminfo() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Syminfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Syminfo>(),
        4usize,
        concat!("Size of: ", stringify!(Elf32_Syminfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Syminfo>(),
        2usize,
        concat!("Alignment of ", stringify!(Elf32_Syminfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_boundto) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Syminfo),
            "::",
            stringify!(si_boundto)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_flags) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Syminfo),
            "::",
            stringify!(si_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Syminfo {
    pub si_boundto: Elf64_Half,
    pub si_flags: Elf64_Half,
}
#[test]
fn bindgen_test_layout_Elf64_Syminfo() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Syminfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Syminfo>(),
        4usize,
        concat!("Size of: ", stringify!(Elf64_Syminfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Syminfo>(),
        2usize,
        concat!("Alignment of ", stringify!(Elf64_Syminfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_boundto) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Syminfo),
            "::",
            stringify!(si_boundto)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_flags) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Syminfo),
            "::",
            stringify!(si_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Rel {
    pub r_offset: Elf32_Addr,
    pub r_info: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Rel() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Rel> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Rel>(),
        8usize,
        concat!("Size of: ", stringify!(Elf32_Rel))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Rel>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Rel))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Rel),
            "::",
            stringify!(r_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_info) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Rel),
            "::",
            stringify!(r_info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Rel {
    pub r_offset: Elf64_Addr,
    pub r_info: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Rel() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Rel> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Rel>(),
        16usize,
        concat!("Size of: ", stringify!(Elf64_Rel))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Rel>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Rel))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Rel),
            "::",
            stringify!(r_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Rel),
            "::",
            stringify!(r_info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Rela {
    pub r_offset: Elf32_Addr,
    pub r_info: Elf32_Word,
    pub r_addend: Elf32_Sword,
}
#[test]
fn bindgen_test_layout_Elf32_Rela() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Rela> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Rela>(),
        12usize,
        concat!("Size of: ", stringify!(Elf32_Rela))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Rela>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Rela))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Rela),
            "::",
            stringify!(r_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_info) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Rela),
            "::",
            stringify!(r_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_addend) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Rela),
            "::",
            stringify!(r_addend)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Rela {
    pub r_offset: Elf64_Addr,
    pub r_info: Elf64_Xword,
    pub r_addend: Elf64_Sxword,
}
#[test]
fn bindgen_test_layout_Elf64_Rela() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Rela> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Rela>(),
        24usize,
        concat!("Size of: ", stringify!(Elf64_Rela))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Rela>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Rela))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Rela),
            "::",
            stringify!(r_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Rela),
            "::",
            stringify!(r_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_addend) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Rela),
            "::",
            stringify!(r_addend)
        )
    );
}
pub type Elf32_Relr = Elf32_Word;
pub type Elf64_Relr = Elf64_Xword;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Phdr {
    pub p_type: Elf32_Word,
    pub p_offset: Elf32_Off,
    pub p_vaddr: Elf32_Addr,
    pub p_paddr: Elf32_Addr,
    pub p_filesz: Elf32_Word,
    pub p_memsz: Elf32_Word,
    pub p_flags: Elf32_Word,
    pub p_align: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Phdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Phdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Phdr>(),
        32usize,
        concat!("Size of: ", stringify!(Elf32_Phdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Phdr>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Phdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Phdr),
            "::",
            stringify!(p_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_offset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Phdr),
            "::",
            stringify!(p_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_vaddr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Phdr),
            "::",
            stringify!(p_vaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_paddr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Phdr),
            "::",
            stringify!(p_paddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_filesz) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Phdr),
            "::",
            stringify!(p_filesz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_memsz) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Phdr),
            "::",
            stringify!(p_memsz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Phdr),
            "::",
            stringify!(p_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_align) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Phdr),
            "::",
            stringify!(p_align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Phdr {
    pub p_type: Elf64_Word,
    pub p_flags: Elf64_Word,
    pub p_offset: Elf64_Off,
    pub p_vaddr: Elf64_Addr,
    pub p_paddr: Elf64_Addr,
    pub p_filesz: Elf64_Xword,
    pub p_memsz: Elf64_Xword,
    pub p_align: Elf64_Xword,
}
#[test]
fn bindgen_test_layout_Elf64_Phdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Phdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Phdr>(),
        56usize,
        concat!("Size of: ", stringify!(Elf64_Phdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Phdr>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Phdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Phdr),
            "::",
            stringify!(p_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Phdr),
            "::",
            stringify!(p_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Phdr),
            "::",
            stringify!(p_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_vaddr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Phdr),
            "::",
            stringify!(p_vaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_paddr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Phdr),
            "::",
            stringify!(p_paddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_filesz) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Phdr),
            "::",
            stringify!(p_filesz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_memsz) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Phdr),
            "::",
            stringify!(p_memsz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_align) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Phdr),
            "::",
            stringify!(p_align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Elf32_Dyn {
    pub d_tag: Elf32_Sword,
    pub d_un: Elf32_Dyn__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Elf32_Dyn__bindgen_ty_1 {
    pub d_val: Elf32_Word,
    pub d_ptr: Elf32_Addr,
}
#[test]
fn bindgen_test_layout_Elf32_Dyn__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Dyn__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Dyn__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(Elf32_Dyn__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Dyn__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Dyn__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Dyn__bindgen_ty_1),
            "::",
            stringify!(d_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Dyn__bindgen_ty_1),
            "::",
            stringify!(d_ptr)
        )
    );
}
#[test]
fn bindgen_test_layout_Elf32_Dyn() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Dyn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Dyn>(),
        8usize,
        concat!("Size of: ", stringify!(Elf32_Dyn))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Dyn>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Dyn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Dyn),
            "::",
            stringify!(d_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_un) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Dyn),
            "::",
            stringify!(d_un)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Elf64_Dyn {
    pub d_tag: Elf64_Sxword,
    pub d_un: Elf64_Dyn__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Elf64_Dyn__bindgen_ty_1 {
    pub d_val: Elf64_Xword,
    pub d_ptr: Elf64_Addr,
}
#[test]
fn bindgen_test_layout_Elf64_Dyn__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Dyn__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Dyn__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(Elf64_Dyn__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Dyn__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Dyn__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Dyn__bindgen_ty_1),
            "::",
            stringify!(d_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Dyn__bindgen_ty_1),
            "::",
            stringify!(d_ptr)
        )
    );
}
#[test]
fn bindgen_test_layout_Elf64_Dyn() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Dyn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Dyn>(),
        16usize,
        concat!("Size of: ", stringify!(Elf64_Dyn))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Dyn>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Dyn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Dyn),
            "::",
            stringify!(d_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_un) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Dyn),
            "::",
            stringify!(d_un)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Verdef {
    pub vd_version: Elf32_Half,
    pub vd_flags: Elf32_Half,
    pub vd_ndx: Elf32_Half,
    pub vd_cnt: Elf32_Half,
    pub vd_hash: Elf32_Word,
    pub vd_aux: Elf32_Word,
    pub vd_next: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Verdef() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Verdef> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Verdef>(),
        20usize,
        concat!("Size of: ", stringify!(Elf32_Verdef))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Verdef>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Verdef))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verdef),
            "::",
            stringify!(vd_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_flags) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verdef),
            "::",
            stringify!(vd_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_ndx) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verdef),
            "::",
            stringify!(vd_ndx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_cnt) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verdef),
            "::",
            stringify!(vd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_hash) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verdef),
            "::",
            stringify!(vd_hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_aux) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verdef),
            "::",
            stringify!(vd_aux)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verdef),
            "::",
            stringify!(vd_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Verdef {
    pub vd_version: Elf64_Half,
    pub vd_flags: Elf64_Half,
    pub vd_ndx: Elf64_Half,
    pub vd_cnt: Elf64_Half,
    pub vd_hash: Elf64_Word,
    pub vd_aux: Elf64_Word,
    pub vd_next: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Verdef() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Verdef> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Verdef>(),
        20usize,
        concat!("Size of: ", stringify!(Elf64_Verdef))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Verdef>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf64_Verdef))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verdef),
            "::",
            stringify!(vd_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_flags) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verdef),
            "::",
            stringify!(vd_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_ndx) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verdef),
            "::",
            stringify!(vd_ndx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_cnt) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verdef),
            "::",
            stringify!(vd_cnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_hash) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verdef),
            "::",
            stringify!(vd_hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_aux) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verdef),
            "::",
            stringify!(vd_aux)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vd_next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verdef),
            "::",
            stringify!(vd_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Verdaux {
    pub vda_name: Elf32_Word,
    pub vda_next: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Verdaux() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Verdaux> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Verdaux>(),
        8usize,
        concat!("Size of: ", stringify!(Elf32_Verdaux))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Verdaux>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Verdaux))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vda_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verdaux),
            "::",
            stringify!(vda_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vda_next) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verdaux),
            "::",
            stringify!(vda_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Verdaux {
    pub vda_name: Elf64_Word,
    pub vda_next: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Verdaux() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Verdaux> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Verdaux>(),
        8usize,
        concat!("Size of: ", stringify!(Elf64_Verdaux))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Verdaux>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf64_Verdaux))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vda_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verdaux),
            "::",
            stringify!(vda_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vda_next) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verdaux),
            "::",
            stringify!(vda_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Verneed {
    pub vn_version: Elf32_Half,
    pub vn_cnt: Elf32_Half,
    pub vn_file: Elf32_Word,
    pub vn_aux: Elf32_Word,
    pub vn_next: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Verneed() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Verneed> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Verneed>(),
        16usize,
        concat!("Size of: ", stringify!(Elf32_Verneed))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Verneed>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Verneed))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verneed),
            "::",
            stringify!(vn_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_cnt) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verneed),
            "::",
            stringify!(vn_cnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_file) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verneed),
            "::",
            stringify!(vn_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_aux) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verneed),
            "::",
            stringify!(vn_aux)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_next) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Verneed),
            "::",
            stringify!(vn_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Verneed {
    pub vn_version: Elf64_Half,
    pub vn_cnt: Elf64_Half,
    pub vn_file: Elf64_Word,
    pub vn_aux: Elf64_Word,
    pub vn_next: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Verneed() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Verneed> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Verneed>(),
        16usize,
        concat!("Size of: ", stringify!(Elf64_Verneed))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Verneed>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf64_Verneed))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verneed),
            "::",
            stringify!(vn_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_cnt) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verneed),
            "::",
            stringify!(vn_cnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_file) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verneed),
            "::",
            stringify!(vn_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_aux) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verneed),
            "::",
            stringify!(vn_aux)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vn_next) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Verneed),
            "::",
            stringify!(vn_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Vernaux {
    pub vna_hash: Elf32_Word,
    pub vna_flags: Elf32_Half,
    pub vna_other: Elf32_Half,
    pub vna_name: Elf32_Word,
    pub vna_next: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Vernaux() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Vernaux> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Vernaux>(),
        16usize,
        concat!("Size of: ", stringify!(Elf32_Vernaux))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Vernaux>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Vernaux))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Vernaux),
            "::",
            stringify!(vna_hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Vernaux),
            "::",
            stringify!(vna_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_other) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Vernaux),
            "::",
            stringify!(vna_other)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Vernaux),
            "::",
            stringify!(vna_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_next) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Vernaux),
            "::",
            stringify!(vna_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Vernaux {
    pub vna_hash: Elf64_Word,
    pub vna_flags: Elf64_Half,
    pub vna_other: Elf64_Half,
    pub vna_name: Elf64_Word,
    pub vna_next: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Vernaux() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Vernaux> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Vernaux>(),
        16usize,
        concat!("Size of: ", stringify!(Elf64_Vernaux))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Vernaux>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf64_Vernaux))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Vernaux),
            "::",
            stringify!(vna_hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Vernaux),
            "::",
            stringify!(vna_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_other) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Vernaux),
            "::",
            stringify!(vna_other)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Vernaux),
            "::",
            stringify!(vna_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vna_next) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Vernaux),
            "::",
            stringify!(vna_next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Elf32_auxv_t {
    pub a_type: u32,
    pub a_un: Elf32_auxv_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Elf32_auxv_t__bindgen_ty_1 {
    pub a_val: u32,
}
#[test]
fn bindgen_test_layout_Elf32_auxv_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_auxv_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_auxv_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(Elf32_auxv_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_auxv_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_auxv_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_auxv_t__bindgen_ty_1),
            "::",
            stringify!(a_val)
        )
    );
}
#[test]
fn bindgen_test_layout_Elf32_auxv_t() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_auxv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_auxv_t>(),
        8usize,
        concat!("Size of: ", stringify!(Elf32_auxv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_auxv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_auxv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_auxv_t),
            "::",
            stringify!(a_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a_un) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_auxv_t),
            "::",
            stringify!(a_un)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Elf64_auxv_t {
    pub a_type: u64,
    pub a_un: Elf64_auxv_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Elf64_auxv_t__bindgen_ty_1 {
    pub a_val: u64,
}
#[test]
fn bindgen_test_layout_Elf64_auxv_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_auxv_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_auxv_t__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(Elf64_auxv_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_auxv_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_auxv_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_auxv_t__bindgen_ty_1),
            "::",
            stringify!(a_val)
        )
    );
}
#[test]
fn bindgen_test_layout_Elf64_auxv_t() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_auxv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_auxv_t>(),
        16usize,
        concat!("Size of: ", stringify!(Elf64_auxv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_auxv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_auxv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_auxv_t),
            "::",
            stringify!(a_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a_un) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_auxv_t),
            "::",
            stringify!(a_un)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Nhdr {
    pub n_namesz: Elf32_Word,
    pub n_descsz: Elf32_Word,
    pub n_type: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Nhdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Nhdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Nhdr>(),
        12usize,
        concat!("Size of: ", stringify!(Elf32_Nhdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Nhdr>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Nhdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_namesz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Nhdr),
            "::",
            stringify!(n_namesz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_descsz) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Nhdr),
            "::",
            stringify!(n_descsz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Nhdr),
            "::",
            stringify!(n_type)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Nhdr {
    pub n_namesz: Elf64_Word,
    pub n_descsz: Elf64_Word,
    pub n_type: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Nhdr() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Nhdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Nhdr>(),
        12usize,
        concat!("Size of: ", stringify!(Elf64_Nhdr))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Nhdr>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf64_Nhdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_namesz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Nhdr),
            "::",
            stringify!(n_namesz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_descsz) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Nhdr),
            "::",
            stringify!(n_descsz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Nhdr),
            "::",
            stringify!(n_type)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Move {
    pub m_value: Elf32_Xword,
    pub m_info: Elf32_Word,
    pub m_poffset: Elf32_Word,
    pub m_repeat: Elf32_Half,
    pub m_stride: Elf32_Half,
}
#[test]
fn bindgen_test_layout_Elf32_Move() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Move> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Move>(),
        24usize,
        concat!("Size of: ", stringify!(Elf32_Move))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Move>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf32_Move))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Move),
            "::",
            stringify!(m_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Move),
            "::",
            stringify!(m_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_poffset) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Move),
            "::",
            stringify!(m_poffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_repeat) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Move),
            "::",
            stringify!(m_repeat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_stride) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Move),
            "::",
            stringify!(m_stride)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Move {
    pub m_value: Elf64_Xword,
    pub m_info: Elf64_Xword,
    pub m_poffset: Elf64_Xword,
    pub m_repeat: Elf64_Half,
    pub m_stride: Elf64_Half,
}
#[test]
fn bindgen_test_layout_Elf64_Move() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Move> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Move>(),
        32usize,
        concat!("Size of: ", stringify!(Elf64_Move))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Move>(),
        8usize,
        concat!("Alignment of ", stringify!(Elf64_Move))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Move),
            "::",
            stringify!(m_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_info) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Move),
            "::",
            stringify!(m_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_poffset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Move),
            "::",
            stringify!(m_poffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_repeat) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Move),
            "::",
            stringify!(m_repeat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_stride) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Move),
            "::",
            stringify!(m_stride)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Elf32_gptab {
    pub gt_header: Elf32_gptab__bindgen_ty_1,
    pub gt_entry: Elf32_gptab__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_gptab__bindgen_ty_1 {
    pub gt_current_g_value: Elf32_Word,
    pub gt_unused: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_gptab__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_gptab__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_gptab__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(Elf32_gptab__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_gptab__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_gptab__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gt_current_g_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_gptab__bindgen_ty_1),
            "::",
            stringify!(gt_current_g_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gt_unused) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_gptab__bindgen_ty_1),
            "::",
            stringify!(gt_unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_gptab__bindgen_ty_2 {
    pub gt_g_value: Elf32_Word,
    pub gt_bytes: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_gptab__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_gptab__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_gptab__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(Elf32_gptab__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_gptab__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_gptab__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gt_g_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_gptab__bindgen_ty_2),
            "::",
            stringify!(gt_g_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gt_bytes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_gptab__bindgen_ty_2),
            "::",
            stringify!(gt_bytes)
        )
    );
}
#[test]
fn bindgen_test_layout_Elf32_gptab() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_gptab> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_gptab>(),
        8usize,
        concat!("Size of: ", stringify!(Elf32_gptab))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_gptab>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_gptab))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gt_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_gptab),
            "::",
            stringify!(gt_header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gt_entry) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_gptab),
            "::",
            stringify!(gt_entry)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_RegInfo {
    pub ri_gprmask: Elf32_Word,
    pub ri_cprmask: [Elf32_Word; 4usize],
    pub ri_gp_value: Elf32_Sword,
}
#[test]
fn bindgen_test_layout_Elf32_RegInfo() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_RegInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_RegInfo>(),
        24usize,
        concat!("Size of: ", stringify!(Elf32_RegInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_RegInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_RegInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ri_gprmask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_RegInfo),
            "::",
            stringify!(ri_gprmask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ri_cprmask) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_RegInfo),
            "::",
            stringify!(ri_cprmask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ri_gp_value) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_RegInfo),
            "::",
            stringify!(ri_gp_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf_Options {
    pub kind: ::std::os::raw::c_uchar,
    pub size: ::std::os::raw::c_uchar,
    pub section: Elf32_Section,
    pub info: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf_Options() {
    const UNINIT: ::std::mem::MaybeUninit<Elf_Options> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf_Options>(),
        8usize,
        concat!("Size of: ", stringify!(Elf_Options))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf_Options>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf_Options))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).kind) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_Options),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_Options),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).section) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_Options),
            "::",
            stringify!(section)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_Options),
            "::",
            stringify!(info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf_Options_Hw {
    pub hwp_flags1: Elf32_Word,
    pub hwp_flags2: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf_Options_Hw() {
    const UNINIT: ::std::mem::MaybeUninit<Elf_Options_Hw> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf_Options_Hw>(),
        8usize,
        concat!("Size of: ", stringify!(Elf_Options_Hw))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf_Options_Hw>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf_Options_Hw))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hwp_flags1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_Options_Hw),
            "::",
            stringify!(hwp_flags1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hwp_flags2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_Options_Hw),
            "::",
            stringify!(hwp_flags2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf32_Lib {
    pub l_name: Elf32_Word,
    pub l_time_stamp: Elf32_Word,
    pub l_checksum: Elf32_Word,
    pub l_version: Elf32_Word,
    pub l_flags: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf32_Lib() {
    const UNINIT: ::std::mem::MaybeUninit<Elf32_Lib> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf32_Lib>(),
        20usize,
        concat!("Size of: ", stringify!(Elf32_Lib))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf32_Lib>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf32_Lib))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Lib),
            "::",
            stringify!(l_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_time_stamp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Lib),
            "::",
            stringify!(l_time_stamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_checksum) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Lib),
            "::",
            stringify!(l_checksum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_version) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Lib),
            "::",
            stringify!(l_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf32_Lib),
            "::",
            stringify!(l_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf64_Lib {
    pub l_name: Elf64_Word,
    pub l_time_stamp: Elf64_Word,
    pub l_checksum: Elf64_Word,
    pub l_version: Elf64_Word,
    pub l_flags: Elf64_Word,
}
#[test]
fn bindgen_test_layout_Elf64_Lib() {
    const UNINIT: ::std::mem::MaybeUninit<Elf64_Lib> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf64_Lib>(),
        20usize,
        concat!("Size of: ", stringify!(Elf64_Lib))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf64_Lib>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf64_Lib))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Lib),
            "::",
            stringify!(l_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_time_stamp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Lib),
            "::",
            stringify!(l_time_stamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_checksum) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Lib),
            "::",
            stringify!(l_checksum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_version) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Lib),
            "::",
            stringify!(l_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf64_Lib),
            "::",
            stringify!(l_flags)
        )
    );
}
pub type Elf32_Conflict = Elf32_Addr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Elf_MIPS_ABIFlags_v0 {
    pub version: Elf32_Half,
    pub isa_level: ::std::os::raw::c_uchar,
    pub isa_rev: ::std::os::raw::c_uchar,
    pub gpr_size: ::std::os::raw::c_uchar,
    pub cpr1_size: ::std::os::raw::c_uchar,
    pub cpr2_size: ::std::os::raw::c_uchar,
    pub fp_abi: ::std::os::raw::c_uchar,
    pub isa_ext: Elf32_Word,
    pub ases: Elf32_Word,
    pub flags1: Elf32_Word,
    pub flags2: Elf32_Word,
}
#[test]
fn bindgen_test_layout_Elf_MIPS_ABIFlags_v0() {
    const UNINIT: ::std::mem::MaybeUninit<Elf_MIPS_ABIFlags_v0> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Elf_MIPS_ABIFlags_v0>(),
        24usize,
        concat!("Size of: ", stringify!(Elf_MIPS_ABIFlags_v0))
    );
    assert_eq!(
        ::std::mem::align_of::<Elf_MIPS_ABIFlags_v0>(),
        4usize,
        concat!("Alignment of ", stringify!(Elf_MIPS_ABIFlags_v0))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isa_level) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(isa_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isa_rev) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(isa_rev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gpr_size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(gpr_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpr1_size) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(cpr1_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cpr2_size) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(cpr2_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_abi) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(fp_abi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isa_ext) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(isa_ext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ases) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(ases)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(flags1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags2) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Elf_MIPS_ABIFlags_v0),
            "::",
            stringify!(flags2)
        )
    );
}
pub const Val_GNU_MIPS_ABI_FP_ANY: _bindgen_ty_7 = 0;
pub const Val_GNU_MIPS_ABI_FP_DOUBLE: _bindgen_ty_7 = 1;
pub const Val_GNU_MIPS_ABI_FP_SINGLE: _bindgen_ty_7 = 2;
pub const Val_GNU_MIPS_ABI_FP_SOFT: _bindgen_ty_7 = 3;
pub const Val_GNU_MIPS_ABI_FP_OLD_64: _bindgen_ty_7 = 4;
pub const Val_GNU_MIPS_ABI_FP_XX: _bindgen_ty_7 = 5;
pub const Val_GNU_MIPS_ABI_FP_64: _bindgen_ty_7 = 6;
pub const Val_GNU_MIPS_ABI_FP_64A: _bindgen_ty_7 = 7;
pub const Val_GNU_MIPS_ABI_FP_MAX: _bindgen_ty_7 = 7;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
extern "C" {
    pub static mut error_print_progname: ::std::option::Option<unsafe extern "C" fn()>;
}
extern "C" {
    pub static mut error_message_count: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut error_one_per_line: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct flock {
    pub l_type: ::std::os::raw::c_short,
    pub l_whence: ::std::os::raw::c_short,
    pub l_start: __off_t,
    pub l_len: __off_t,
    pub l_pid: __pid_t,
}
#[test]
fn bindgen_test_layout_flock() {
    const UNINIT: ::std::mem::MaybeUninit<flock> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<flock>(),
        32usize,
        concat!("Size of: ", stringify!(flock))
    );
    assert_eq!(
        ::std::mem::align_of::<flock>(),
        8usize,
        concat!("Alignment of ", stringify!(flock))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_whence) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_whence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(flock),
            "::",
            stringify!(l_pid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub st_ino: __ino_t,
    pub st_mode: __mode_t,
    pub st_nlink: __nlink_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub st_rdev: __dev_t,
    pub __pad1: __dev_t,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub __pad2: ::std::os::raw::c_int,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout_stat() {
    const UNINIT: ::std::mem::MaybeUninit<stat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<stat>(),
        128usize,
        concat!("Size of: ", stringify!(stat))
    );
    assert_eq!(
        ::std::mem::align_of::<stat>(),
        8usize,
        concat!("Alignment of ", stringify!(stat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blksize) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blocks) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atim) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_atim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtim) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mtim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctim) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ctim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__glibc_reserved) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__glibc_reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fstab {
    pub fs_spec: *mut ::std::os::raw::c_char,
    pub fs_file: *mut ::std::os::raw::c_char,
    pub fs_vfstype: *mut ::std::os::raw::c_char,
    pub fs_mntops: *mut ::std::os::raw::c_char,
    pub fs_type: *const ::std::os::raw::c_char,
    pub fs_freq: ::std::os::raw::c_int,
    pub fs_passno: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_fstab() {
    const UNINIT: ::std::mem::MaybeUninit<fstab> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fstab>(),
        48usize,
        concat!("Size of: ", stringify!(fstab))
    );
    assert_eq!(
        ::std::mem::align_of::<fstab>(),
        8usize,
        concat!("Alignment of ", stringify!(fstab))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_spec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fstab),
            "::",
            stringify!(fs_spec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_file) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fstab),
            "::",
            stringify!(fs_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_vfstype) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fstab),
            "::",
            stringify!(fs_vfstype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_mntops) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fstab),
            "::",
            stringify!(fs_mntops)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_type) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fstab),
            "::",
            stringify!(fs_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_freq) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fstab),
            "::",
            stringify!(fs_freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_passno) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(fstab),
            "::",
            stringify!(fs_passno)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FTS {
    pub fts_cur: *mut _ftsent,
    pub fts_child: *mut _ftsent,
    pub fts_array: *mut *mut _ftsent,
    pub fts_dev: dev_t,
    pub fts_path: *mut ::std::os::raw::c_char,
    pub fts_rfd: ::std::os::raw::c_int,
    pub fts_pathlen: ::std::os::raw::c_int,
    pub fts_nitems: ::std::os::raw::c_int,
    pub fts_compar: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub fts_options: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FTS() {
    const UNINIT: ::std::mem::MaybeUninit<FTS> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<FTS>(),
        72usize,
        concat!("Size of: ", stringify!(FTS))
    );
    assert_eq!(
        ::std::mem::align_of::<FTS>(),
        8usize,
        concat!("Alignment of ", stringify!(FTS))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_cur) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_cur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_child) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_child)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_array) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_dev) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_dev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_path) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_rfd) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_rfd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_pathlen) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_pathlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_nitems) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_nitems)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_compar) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_compar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_options) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(FTS),
            "::",
            stringify!(fts_options)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ftsent {
    pub fts_cycle: *mut _ftsent,
    pub fts_parent: *mut _ftsent,
    pub fts_link: *mut _ftsent,
    pub fts_number: ::std::os::raw::c_long,
    pub fts_pointer: *mut ::std::os::raw::c_void,
    pub fts_accpath: *mut ::std::os::raw::c_char,
    pub fts_path: *mut ::std::os::raw::c_char,
    pub fts_errno: ::std::os::raw::c_int,
    pub fts_symfd: ::std::os::raw::c_int,
    pub fts_pathlen: ::std::os::raw::c_ushort,
    pub fts_namelen: ::std::os::raw::c_ushort,
    pub fts_ino: ino_t,
    pub fts_dev: dev_t,
    pub fts_nlink: nlink_t,
    pub fts_level: ::std::os::raw::c_short,
    pub fts_info: ::std::os::raw::c_ushort,
    pub fts_flags: ::std::os::raw::c_ushort,
    pub fts_instr: ::std::os::raw::c_ushort,
    pub fts_statp: *mut stat,
    pub fts_name: [::std::os::raw::c_char; 1usize],
}
#[test]
fn bindgen_test_layout__ftsent() {
    const UNINIT: ::std::mem::MaybeUninit<_ftsent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_ftsent>(),
        120usize,
        concat!("Size of: ", stringify!(_ftsent))
    );
    assert_eq!(
        ::std::mem::align_of::<_ftsent>(),
        8usize,
        concat!("Alignment of ", stringify!(_ftsent))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_cycle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_cycle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_parent) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_parent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_link) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_link)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_number) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_number)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_pointer) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_pointer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_accpath) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_accpath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_path) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_errno) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_errno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_symfd) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_symfd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_pathlen) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_pathlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_namelen) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_namelen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_ino) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_dev) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_dev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_nlink) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_nlink)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_level) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_info) as usize - ptr as usize },
        94usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_flags) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_instr) as usize - ptr as usize },
        98usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_instr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_statp) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_statp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fts_name) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_ftsent),
            "::",
            stringify!(fts_name)
        )
    );
}
pub type FTSENT = _ftsent;
pub const FTW_F: _bindgen_ty_8 = 0;
pub const FTW_D: _bindgen_ty_8 = 1;
pub const FTW_DNR: _bindgen_ty_8 = 2;
pub const FTW_NS: _bindgen_ty_8 = 3;
pub const FTW_SL: _bindgen_ty_8 = 4;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub type __ftw_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        __filename: *const ::std::os::raw::c_char,
        __status: *const stat,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub const awk_bool_awk_false: awk_bool = 0;
pub const awk_bool_awk_true: awk_bool = 1;
pub type awk_bool = ::std::os::raw::c_uint;
pub use self::awk_bool as awk_bool_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_fieldwidth_info_t {
    pub use_chars: awk_bool_t,
    pub nf: usize,
    pub fields: [awk_fieldwidth_info_t_awk_field_info; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_fieldwidth_info_t_awk_field_info {
    pub skip: usize,
    pub len: usize,
}
#[test]
fn bindgen_test_layout_awk_fieldwidth_info_t_awk_field_info() {
    const UNINIT: ::std::mem::MaybeUninit<awk_fieldwidth_info_t_awk_field_info> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_fieldwidth_info_t_awk_field_info>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(awk_fieldwidth_info_t_awk_field_info)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<awk_fieldwidth_info_t_awk_field_info>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(awk_fieldwidth_info_t_awk_field_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skip) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_fieldwidth_info_t_awk_field_info),
            "::",
            stringify!(skip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_fieldwidth_info_t_awk_field_info),
            "::",
            stringify!(len)
        )
    );
}
#[test]
fn bindgen_test_layout_awk_fieldwidth_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<awk_fieldwidth_info_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_fieldwidth_info_t>(),
        32usize,
        concat!("Size of: ", stringify!(awk_fieldwidth_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_fieldwidth_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_fieldwidth_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_chars) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_fieldwidth_info_t),
            "::",
            stringify!(use_chars)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_fieldwidth_info_t),
            "::",
            stringify!(nf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fields) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_fieldwidth_info_t),
            "::",
            stringify!(fields)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_input {
    pub name: *const ::std::os::raw::c_char,
    pub fd: ::std::os::raw::c_int,
    pub opaque: *mut ::std::os::raw::c_void,
    pub get_record: ::std::option::Option<
        unsafe extern "C" fn(
            out: *mut *mut ::std::os::raw::c_char,
            iobuf: *mut awk_input,
            errcode: *mut ::std::os::raw::c_int,
            rt_start: *mut *mut ::std::os::raw::c_char,
            rt_len: *mut usize,
            field_width: *mut *const awk_fieldwidth_info_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub read_func: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut ::std::os::raw::c_void,
            arg3: usize,
        ) -> isize,
    >,
    pub close_func: ::std::option::Option<unsafe extern "C" fn(iobuf: *mut awk_input)>,
    pub sbuf: stat,
}
#[test]
fn bindgen_test_layout_awk_input() {
    const UNINIT: ::std::mem::MaybeUninit<awk_input> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_input>(),
        176usize,
        concat!("Size of: ", stringify!(awk_input))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_input>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_input))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input),
            "::",
            stringify!(opaque)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_record) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input),
            "::",
            stringify!(get_record)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input),
            "::",
            stringify!(read_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input),
            "::",
            stringify!(close_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sbuf) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input),
            "::",
            stringify!(sbuf)
        )
    );
}
pub type awk_input_buf_t = awk_input;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_input_parser {
    pub name: *const ::std::os::raw::c_char,
    pub can_take_file:
        ::std::option::Option<unsafe extern "C" fn(iobuf: *const awk_input_buf_t) -> awk_bool_t>,
    pub take_control_of:
        ::std::option::Option<unsafe extern "C" fn(iobuf: *mut awk_input_buf_t) -> awk_bool_t>,
    pub next: *const awk_input_parser,
}
#[test]
fn bindgen_test_layout_awk_input_parser() {
    const UNINIT: ::std::mem::MaybeUninit<awk_input_parser> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_input_parser>(),
        32usize,
        concat!("Size of: ", stringify!(awk_input_parser))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_input_parser>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_input_parser))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input_parser),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).can_take_file) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input_parser),
            "::",
            stringify!(can_take_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).take_control_of) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input_parser),
            "::",
            stringify!(take_control_of)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_input_parser),
            "::",
            stringify!(next)
        )
    );
}
pub type awk_input_parser_t = awk_input_parser;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_output_buf {
    pub name: *const ::std::os::raw::c_char,
    pub mode: *const ::std::os::raw::c_char,
    pub fp: *mut FILE,
    pub redirected: awk_bool_t,
    pub opaque: *mut ::std::os::raw::c_void,
    pub gawk_fwrite: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *const ::std::os::raw::c_void,
            size: usize,
            count: usize,
            fp: *mut FILE,
            opaque: *mut ::std::os::raw::c_void,
        ) -> usize,
    >,
    pub gawk_fflush: ::std::option::Option<
        unsafe extern "C" fn(
            fp: *mut FILE,
            opaque: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub gawk_ferror: ::std::option::Option<
        unsafe extern "C" fn(
            fp: *mut FILE,
            opaque: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub gawk_fclose: ::std::option::Option<
        unsafe extern "C" fn(
            fp: *mut FILE,
            opaque: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_awk_output_buf() {
    const UNINIT: ::std::mem::MaybeUninit<awk_output_buf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_output_buf>(),
        72usize,
        concat!("Size of: ", stringify!(awk_output_buf))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_output_buf>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_output_buf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_buf),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_buf),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_buf),
            "::",
            stringify!(fp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).redirected) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_buf),
            "::",
            stringify!(redirected)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opaque) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_buf),
            "::",
            stringify!(opaque)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gawk_fwrite) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_buf),
            "::",
            stringify!(gawk_fwrite)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gawk_fflush) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_buf),
            "::",
            stringify!(gawk_fflush)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gawk_ferror) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_buf),
            "::",
            stringify!(gawk_ferror)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gawk_fclose) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_buf),
            "::",
            stringify!(gawk_fclose)
        )
    );
}
pub type awk_output_buf_t = awk_output_buf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_output_wrapper {
    pub name: *const ::std::os::raw::c_char,
    pub can_take_file:
        ::std::option::Option<unsafe extern "C" fn(outbuf: *const awk_output_buf_t) -> awk_bool_t>,
    pub take_control_of:
        ::std::option::Option<unsafe extern "C" fn(outbuf: *mut awk_output_buf_t) -> awk_bool_t>,
    pub next: *const awk_output_wrapper,
}
#[test]
fn bindgen_test_layout_awk_output_wrapper() {
    const UNINIT: ::std::mem::MaybeUninit<awk_output_wrapper> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_output_wrapper>(),
        32usize,
        concat!("Size of: ", stringify!(awk_output_wrapper))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_output_wrapper>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_output_wrapper))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_wrapper),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).can_take_file) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_wrapper),
            "::",
            stringify!(can_take_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).take_control_of) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_wrapper),
            "::",
            stringify!(take_control_of)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_output_wrapper),
            "::",
            stringify!(next)
        )
    );
}
pub type awk_output_wrapper_t = awk_output_wrapper;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_two_way_processor {
    pub name: *const ::std::os::raw::c_char,
    pub can_take_two_way: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> awk_bool_t,
    >,
    pub take_control_of: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            inbuf: *mut awk_input_buf_t,
            outbuf: *mut awk_output_buf_t,
        ) -> awk_bool_t,
    >,
    pub next: *const awk_two_way_processor,
}
#[test]
fn bindgen_test_layout_awk_two_way_processor() {
    const UNINIT: ::std::mem::MaybeUninit<awk_two_way_processor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_two_way_processor>(),
        32usize,
        concat!("Size of: ", stringify!(awk_two_way_processor))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_two_way_processor>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_two_way_processor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_two_way_processor),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).can_take_two_way) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_two_way_processor),
            "::",
            stringify!(can_take_two_way)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).take_control_of) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_two_way_processor),
            "::",
            stringify!(take_control_of)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_two_way_processor),
            "::",
            stringify!(next)
        )
    );
}
pub type awk_two_way_processor_t = awk_two_way_processor;
pub const GAWK_API_MAJOR_VERSION: _bindgen_ty_9 = 3;
pub const GAWK_API_MINOR_VERSION: _bindgen_ty_9 = 2;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_string {
    pub str_: *mut ::std::os::raw::c_char,
    pub len: usize,
}
#[test]
fn bindgen_test_layout_awk_string() {
    const UNINIT: ::std::mem::MaybeUninit<awk_string> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_string>(),
        16usize,
        concat!("Size of: ", stringify!(awk_string))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_string>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_string))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_string),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_string),
            "::",
            stringify!(len)
        )
    );
}
pub type awk_string_t = awk_string;
pub const AWK_NUMBER_TYPE_AWK_NUMBER_TYPE_DOUBLE: AWK_NUMBER_TYPE = 0;
pub const AWK_NUMBER_TYPE_AWK_NUMBER_TYPE_MPFR: AWK_NUMBER_TYPE = 1;
pub const AWK_NUMBER_TYPE_AWK_NUMBER_TYPE_MPZ: AWK_NUMBER_TYPE = 2;
pub type AWK_NUMBER_TYPE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_number {
    pub d: f64,
    pub type_: AWK_NUMBER_TYPE,
    pub ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_awk_number() {
    const UNINIT: ::std::mem::MaybeUninit<awk_number> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_number>(),
        24usize,
        concat!("Size of: ", stringify!(awk_number))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_number>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_number))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_number),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_number),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_number),
            "::",
            stringify!(ptr)
        )
    );
}
pub type awk_number_t = awk_number;
pub type awk_array_t = *mut ::std::os::raw::c_void;
pub type awk_scalar_t = *mut ::std::os::raw::c_void;
pub type awk_value_cookie_t = *mut ::std::os::raw::c_void;
pub const awk_valtype_t_AWK_UNDEFINED: awk_valtype_t = 0;
pub const awk_valtype_t_AWK_NUMBER: awk_valtype_t = 1;
pub const awk_valtype_t_AWK_STRING: awk_valtype_t = 2;
pub const awk_valtype_t_AWK_REGEX: awk_valtype_t = 3;
pub const awk_valtype_t_AWK_STRNUM: awk_valtype_t = 4;
pub const awk_valtype_t_AWK_ARRAY: awk_valtype_t = 5;
pub const awk_valtype_t_AWK_SCALAR: awk_valtype_t = 6;
pub const awk_valtype_t_AWK_VALUE_COOKIE: awk_valtype_t = 7;
pub const awk_valtype_t_AWK_BOOL: awk_valtype_t = 8;
pub type awk_valtype_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct awk_value {
    pub val_type: awk_valtype_t,
    pub u: awk_value__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union awk_value__bindgen_ty_1 {
    pub s: awk_string_t,
    pub n: awk_number_t,
    pub a: awk_array_t,
    pub scl: awk_scalar_t,
    pub vc: awk_value_cookie_t,
    pub b: awk_bool_t,
}
#[test]
fn bindgen_test_layout_awk_value__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<awk_value__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_value__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(awk_value__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_value__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_value__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_value__bindgen_ty_1),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_value__bindgen_ty_1),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_value__bindgen_ty_1),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_value__bindgen_ty_1),
            "::",
            stringify!(scl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_value__bindgen_ty_1),
            "::",
            stringify!(vc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_value__bindgen_ty_1),
            "::",
            stringify!(b)
        )
    );
}
#[test]
fn bindgen_test_layout_awk_value() {
    const UNINIT: ::std::mem::MaybeUninit<awk_value> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_value>(),
        32usize,
        concat!("Size of: ", stringify!(awk_value))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_value>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_value))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_value),
            "::",
            stringify!(val_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_value),
            "::",
            stringify!(u)
        )
    );
}
pub type awk_value_t = awk_value;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct awk_element {
    pub next: *mut awk_element,
    pub flags: awk_element__bindgen_ty_1,
    pub index: awk_value_t,
    pub value: awk_value_t,
}
pub const awk_element_AWK_ELEMENT_DEFAULT: awk_element__bindgen_ty_1 = 0;
pub const awk_element_AWK_ELEMENT_DELETE: awk_element__bindgen_ty_1 = 1;
pub type awk_element__bindgen_ty_1 = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_awk_element() {
    const UNINIT: ::std::mem::MaybeUninit<awk_element> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_element>(),
        80usize,
        concat!("Size of: ", stringify!(awk_element))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_element>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_element))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_element),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_element),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_element),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_element),
            "::",
            stringify!(value)
        )
    );
}
pub type awk_element_t = awk_element;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct awk_flat_array {
    pub opaque1: *const ::std::os::raw::c_void,
    pub opaque2: *const ::std::os::raw::c_void,
    pub count: usize,
    pub elements: [awk_element_t; 1usize],
}
#[test]
fn bindgen_test_layout_awk_flat_array() {
    const UNINIT: ::std::mem::MaybeUninit<awk_flat_array> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_flat_array>(),
        104usize,
        concat!("Size of: ", stringify!(awk_flat_array))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_flat_array>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_flat_array))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opaque1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_flat_array),
            "::",
            stringify!(opaque1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opaque2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_flat_array),
            "::",
            stringify!(opaque2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_flat_array),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elements) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_flat_array),
            "::",
            stringify!(elements)
        )
    );
}
pub type awk_flat_array_t = awk_flat_array;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct awk_ext_func {
    pub name: *const ::std::os::raw::c_char,
    pub function: ::std::option::Option<
        unsafe extern "C" fn(
            num_actual_args: ::std::os::raw::c_int,
            result: *mut awk_value_t,
            finfo: *mut awk_ext_func,
        ) -> *mut awk_value_t,
    >,
    pub max_expected_args: usize,
    pub min_required_args: usize,
    pub suppress_lint: awk_bool_t,
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_awk_ext_func() {
    const UNINIT: ::std::mem::MaybeUninit<awk_ext_func> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<awk_ext_func>(),
        48usize,
        concat!("Size of: ", stringify!(awk_ext_func))
    );
    assert_eq!(
        ::std::mem::align_of::<awk_ext_func>(),
        8usize,
        concat!("Alignment of ", stringify!(awk_ext_func))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_ext_func),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).function) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_ext_func),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_expected_args) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_ext_func),
            "::",
            stringify!(max_expected_args)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_required_args) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_ext_func),
            "::",
            stringify!(min_required_args)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suppress_lint) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_ext_func),
            "::",
            stringify!(suppress_lint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(awk_ext_func),
            "::",
            stringify!(data)
        )
    );
}
pub type awk_ext_func_t = awk_ext_func;
pub type awk_ext_id_t = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gawk_api {
    pub major_version: ::std::os::raw::c_int,
    pub minor_version: ::std::os::raw::c_int,
    pub gmp_major_version: ::std::os::raw::c_int,
    pub gmp_minor_version: ::std::os::raw::c_int,
    pub mpfr_major_version: ::std::os::raw::c_int,
    pub mpfr_minor_version: ::std::os::raw::c_int,
    pub do_flags: [::std::os::raw::c_int; 6usize],
    pub api_add_ext_func: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            name_space: *const ::std::os::raw::c_char,
            func: *mut awk_ext_func_t,
        ) -> awk_bool_t,
    >,
    pub api_register_input_parser: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, input_parser: *mut awk_input_parser_t),
    >,
    pub api_register_output_wrapper: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, output_wrapper: *mut awk_output_wrapper_t),
    >,
    pub api_register_two_way_processor: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, two_way_processor: *mut awk_two_way_processor_t),
    >,
    pub api_awk_atexit: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            funcp: ::std::option::Option<
                unsafe extern "C" fn(
                    data: *mut ::std::os::raw::c_void,
                    exit_status: ::std::os::raw::c_int,
                ),
            >,
            arg0: *mut ::std::os::raw::c_void,
        ),
    >,
    pub api_register_ext_version: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, version: *const ::std::os::raw::c_char),
    >,
    pub api_fatal: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, format: *const ::std::os::raw::c_char, ...),
    >,
    pub api_warning: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, format: *const ::std::os::raw::c_char, ...),
    >,
    pub api_lintwarn: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, format: *const ::std::os::raw::c_char, ...),
    >,
    pub api_nonfatal: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, format: *const ::std::os::raw::c_char, ...),
    >,
    pub api_update_ERRNO_int: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, errno_val: ::std::os::raw::c_int),
    >,
    pub api_update_ERRNO_string: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, string: *const ::std::os::raw::c_char),
    >,
    pub api_unset_ERRNO: ::std::option::Option<unsafe extern "C" fn(id: awk_ext_id_t)>,
    pub api_get_argument: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            count: usize,
            wanted: awk_valtype_t,
            result: *mut awk_value_t,
        ) -> awk_bool_t,
    >,
    pub api_set_argument: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, count: usize, array: awk_array_t) -> awk_bool_t,
    >,
    pub api_sym_lookup: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            name_space: *const ::std::os::raw::c_char,
            name: *const ::std::os::raw::c_char,
            wanted: awk_valtype_t,
            result: *mut awk_value_t,
        ) -> awk_bool_t,
    >,
    pub api_sym_update: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            name_space: *const ::std::os::raw::c_char,
            name: *const ::std::os::raw::c_char,
            value: *mut awk_value_t,
        ) -> awk_bool_t,
    >,
    pub api_sym_lookup_scalar: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            cookie: awk_scalar_t,
            wanted: awk_valtype_t,
            result: *mut awk_value_t,
        ) -> awk_bool_t,
    >,
    pub api_sym_update_scalar: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            cookie: awk_scalar_t,
            value: *mut awk_value_t,
        ) -> awk_bool_t,
    >,
    pub api_create_value: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            value: *mut awk_value_t,
            result: *mut awk_value_cookie_t,
        ) -> awk_bool_t,
    >,
    pub api_release_value: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, vc: awk_value_cookie_t) -> awk_bool_t,
    >,
    pub api_get_element_count: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            a_cookie: awk_array_t,
            count: *mut usize,
        ) -> awk_bool_t,
    >,
    pub api_get_array_element: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            a_cookie: awk_array_t,
            index: *const awk_value_t,
            wanted: awk_valtype_t,
            result: *mut awk_value_t,
        ) -> awk_bool_t,
    >,
    pub api_set_array_element: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            a_cookie: awk_array_t,
            index: *const awk_value_t,
            value: *const awk_value_t,
        ) -> awk_bool_t,
    >,
    pub api_del_array_element: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            a_cookie: awk_array_t,
            index: *const awk_value_t,
        ) -> awk_bool_t,
    >,
    pub api_create_array:
        ::std::option::Option<unsafe extern "C" fn(id: awk_ext_id_t) -> awk_array_t>,
    pub api_clear_array: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, a_cookie: awk_array_t) -> awk_bool_t,
    >,
    pub api_flatten_array_typed: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            a_cookie: awk_array_t,
            data: *mut *mut awk_flat_array_t,
            index_type: awk_valtype_t,
            value_type: awk_valtype_t,
        ) -> awk_bool_t,
    >,
    pub api_release_flattened_array: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            a_cookie: awk_array_t,
            data: *mut awk_flat_array_t,
        ) -> awk_bool_t,
    >,
    pub api_malloc:
        ::std::option::Option<unsafe extern "C" fn(size: usize) -> *mut ::std::os::raw::c_void>,
    pub api_calloc: ::std::option::Option<
        unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut ::std::os::raw::c_void,
    >,
    pub api_realloc: ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            size: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub api_free: ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>,
    pub api_get_mpfr: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t) -> *mut ::std::os::raw::c_void,
    >,
    pub api_get_mpz: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t) -> *mut ::std::os::raw::c_void,
    >,
    pub api_get_file: ::std::option::Option<
        unsafe extern "C" fn(
            id: awk_ext_id_t,
            name: *const ::std::os::raw::c_char,
            name_len: usize,
            filetype: *const ::std::os::raw::c_char,
            fd: ::std::os::raw::c_int,
            ibufp: *mut *const awk_input_buf_t,
            obufp: *mut *const awk_output_buf_t,
        ) -> awk_bool_t,
    >,
    pub api_destroy_array: ::std::option::Option<
        unsafe extern "C" fn(id: awk_ext_id_t, a_cookie: awk_array_t) -> awk_bool_t,
    >,
}
#[test]
fn bindgen_test_layout_gawk_api() {
    const UNINIT: ::std::mem::MaybeUninit<gawk_api> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gawk_api>(),
        344usize,
        concat!("Size of: ", stringify!(gawk_api))
    );
    assert_eq!(
        ::std::mem::align_of::<gawk_api>(),
        8usize,
        concat!("Alignment of ", stringify!(gawk_api))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).major_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(major_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minor_version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(minor_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gmp_major_version) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(gmp_major_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gmp_minor_version) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(gmp_minor_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mpfr_major_version) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(mpfr_major_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mpfr_minor_version) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(mpfr_minor_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).do_flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(do_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_add_ext_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_add_ext_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_register_input_parser) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_register_input_parser)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_register_output_wrapper) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_register_output_wrapper)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).api_register_two_way_processor) as usize - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_register_two_way_processor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_awk_atexit) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_awk_atexit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_register_ext_version) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_register_ext_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_fatal) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_fatal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_warning) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_warning)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_lintwarn) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_lintwarn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_nonfatal) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_nonfatal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_update_ERRNO_int) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_update_ERRNO_int)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_update_ERRNO_string) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_update_ERRNO_string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_unset_ERRNO) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_unset_ERRNO)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_get_argument) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_get_argument)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_set_argument) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_set_argument)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_sym_lookup) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_sym_lookup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_sym_update) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_sym_update)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_sym_lookup_scalar) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_sym_lookup_scalar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_sym_update_scalar) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_sym_update_scalar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_create_value) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_create_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_release_value) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_release_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_get_element_count) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_get_element_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_get_array_element) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_get_array_element)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_set_array_element) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_set_array_element)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_del_array_element) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_del_array_element)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_create_array) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_create_array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_clear_array) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_clear_array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_flatten_array_typed) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_flatten_array_typed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_release_flattened_array) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_release_flattened_array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_malloc) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_malloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_calloc) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_calloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_realloc) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_realloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_free) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_free)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_get_mpfr) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_get_mpfr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_get_mpz) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_get_mpz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_get_file) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_get_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).api_destroy_array) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(gawk_api),
            "::",
            stringify!(api_destroy_array)
        )
    );
}
pub type gawk_api_t = gawk_api;
pub type wint_t = ::std::os::raw::c_uint;
pub type wchar_t = ::std::os::raw::c_uint;
pub const __GCONV_OK: _bindgen_ty_10 = 0;
pub const __GCONV_NOCONV: _bindgen_ty_10 = 1;
pub const __GCONV_NODB: _bindgen_ty_10 = 2;
pub const __GCONV_NOMEM: _bindgen_ty_10 = 3;
pub const __GCONV_EMPTY_INPUT: _bindgen_ty_10 = 4;
pub const __GCONV_FULL_OUTPUT: _bindgen_ty_10 = 5;
pub const __GCONV_ILLEGAL_INPUT: _bindgen_ty_10 = 6;
pub const __GCONV_INCOMPLETE_INPUT: _bindgen_ty_10 = 7;
pub const __GCONV_ILLEGAL_DESCRIPTOR: _bindgen_ty_10 = 8;
pub const __GCONV_INTERNAL_ERROR: _bindgen_ty_10 = 9;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
pub const __GCONV_IS_LAST: _bindgen_ty_11 = 1;
pub const __GCONV_IGNORE_ERRORS: _bindgen_ty_11 = 2;
pub const __GCONV_SWAP: _bindgen_ty_11 = 4;
pub const __GCONV_TRANSLIT: _bindgen_ty_11 = 8;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gconv_loaded_object {
    _unused: [u8; 0],
}
pub type __gconv_fct = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut __gconv_step,
        arg2: *mut __gconv_step_data,
        arg3: *mut *const ::std::os::raw::c_uchar,
        arg4: *const ::std::os::raw::c_uchar,
        arg5: *mut *mut ::std::os::raw::c_uchar,
        arg6: *mut usize,
        arg7: ::std::os::raw::c_int,
        arg8: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type __gconv_btowc_fct = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut __gconv_step, arg2: ::std::os::raw::c_uchar) -> wint_t,
>;
pub type __gconv_init_fct =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut __gconv_step) -> ::std::os::raw::c_int>;
pub type __gconv_end_fct = ::std::option::Option<unsafe extern "C" fn(arg1: *mut __gconv_step)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gconv_step {
    pub __shlib_handle: *mut __gconv_loaded_object,
    pub __modname: *const ::std::os::raw::c_char,
    pub __counter: ::std::os::raw::c_int,
    pub __from_name: *mut ::std::os::raw::c_char,
    pub __to_name: *mut ::std::os::raw::c_char,
    pub __fct: __gconv_fct,
    pub __btowc_fct: __gconv_btowc_fct,
    pub __init_fct: __gconv_init_fct,
    pub __end_fct: __gconv_end_fct,
    pub __min_needed_from: ::std::os::raw::c_int,
    pub __max_needed_from: ::std::os::raw::c_int,
    pub __min_needed_to: ::std::os::raw::c_int,
    pub __max_needed_to: ::std::os::raw::c_int,
    pub __stateful: ::std::os::raw::c_int,
    pub __data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___gconv_step() {
    const UNINIT: ::std::mem::MaybeUninit<__gconv_step> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__gconv_step>(),
        104usize,
        concat!("Size of: ", stringify!(__gconv_step))
    );
    assert_eq!(
        ::std::mem::align_of::<__gconv_step>(),
        8usize,
        concat!("Alignment of ", stringify!(__gconv_step))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shlib_handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__shlib_handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__modname) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__modname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__counter) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__counter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__from_name) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__from_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__to_name) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__to_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fct) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__fct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__btowc_fct) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__btowc_fct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__init_fct) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__init_fct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__end_fct) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__end_fct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__min_needed_from) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__min_needed_from)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__max_needed_from) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__max_needed_from)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__min_needed_to) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__min_needed_to)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__max_needed_to) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__max_needed_to)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__stateful) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__stateful)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step),
            "::",
            stringify!(__data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __gconv_step_data {
    pub __outbuf: *mut ::std::os::raw::c_uchar,
    pub __outbufend: *mut ::std::os::raw::c_uchar,
    pub __flags: ::std::os::raw::c_int,
    pub __invocation_counter: ::std::os::raw::c_int,
    pub __internal_use: ::std::os::raw::c_int,
    pub __statep: *mut __mbstate_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout___gconv_step_data() {
    const UNINIT: ::std::mem::MaybeUninit<__gconv_step_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__gconv_step_data>(),
        48usize,
        concat!("Size of: ", stringify!(__gconv_step_data))
    );
    assert_eq!(
        ::std::mem::align_of::<__gconv_step_data>(),
        8usize,
        concat!("Alignment of ", stringify!(__gconv_step_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__outbuf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step_data),
            "::",
            stringify!(__outbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__outbufend) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step_data),
            "::",
            stringify!(__outbufend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step_data),
            "::",
            stringify!(__flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__invocation_counter) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step_data),
            "::",
            stringify!(__invocation_counter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__internal_use) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step_data),
            "::",
            stringify!(__internal_use)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__statep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step_data),
            "::",
            stringify!(__statep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_step_data),
            "::",
            stringify!(__state)
        )
    );
}
#[repr(C)]
pub struct __gconv_info {
    pub __nsteps: usize,
    pub __steps: *mut __gconv_step,
    pub __data: __IncompleteArrayField<__gconv_step_data>,
}
#[test]
fn bindgen_test_layout___gconv_info() {
    const UNINIT: ::std::mem::MaybeUninit<__gconv_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__gconv_info>(),
        16usize,
        concat!("Size of: ", stringify!(__gconv_info))
    );
    assert_eq!(
        ::std::mem::align_of::<__gconv_info>(),
        8usize,
        concat!("Alignment of ", stringify!(__gconv_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nsteps) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_info),
            "::",
            stringify!(__nsteps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__steps) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_info),
            "::",
            stringify!(__steps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__gconv_info),
            "::",
            stringify!(__data)
        )
    );
}
pub type __gconv_t = *mut __gconv_info;
pub type __size_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct glob_t {
    pub gl_pathc: __size_t,
    pub gl_pathv: *mut *mut ::std::os::raw::c_char,
    pub gl_offs: __size_t,
    pub gl_flags: ::std::os::raw::c_int,
    pub gl_closedir: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub gl_readdir: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
    >,
    pub gl_opendir: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
    >,
    pub gl_lstat: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub gl_stat: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_glob_t() {
    const UNINIT: ::std::mem::MaybeUninit<glob_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<glob_t>(),
        72usize,
        concat!("Size of: ", stringify!(glob_t))
    );
    assert_eq!(
        ::std::mem::align_of::<glob_t>(),
        8usize,
        concat!("Alignment of ", stringify!(glob_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_pathc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_pathc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_pathv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_pathv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_offs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_offs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_closedir) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_closedir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_readdir) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_readdir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_opendir) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_opendir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_lstat) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_lstat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gl_stat) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(glob_t),
            "::",
            stringify!(gl_stat)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gmk_floc {
    pub filenm: *const ::std::os::raw::c_char,
    pub lineno: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_gmk_floc() {
    const UNINIT: ::std::mem::MaybeUninit<gmk_floc> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gmk_floc>(),
        16usize,
        concat!("Size of: ", stringify!(gmk_floc))
    );
    assert_eq!(
        ::std::mem::align_of::<gmk_floc>(),
        8usize,
        concat!("Alignment of ", stringify!(gmk_floc))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filenm) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gmk_floc),
            "::",
            stringify!(filenm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lineno) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gmk_floc),
            "::",
            stringify!(lineno)
        )
    );
}
pub type gmk_func_ptr = ::std::option::Option<
    unsafe extern "C" fn(
        nm: *const ::std::os::raw::c_char,
        argc: ::std::os::raw::c_uint,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group {
    pub gr_name: *mut ::std::os::raw::c_char,
    pub gr_passwd: *mut ::std::os::raw::c_char,
    pub gr_gid: __gid_t,
    pub gr_mem: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_group() {
    const UNINIT: ::std::mem::MaybeUninit<group> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<group>(),
        32usize,
        concat!("Size of: ", stringify!(group))
    );
    assert_eq!(
        ::std::mem::align_of::<group>(),
        8usize,
        concat!("Alignment of ", stringify!(group))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group),
            "::",
            stringify!(gr_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_passwd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group),
            "::",
            stringify!(gr_passwd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_gid) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(group),
            "::",
            stringify!(gr_gid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_mem) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(group),
            "::",
            stringify!(gr_mem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sgrp {
    pub sg_namp: *mut ::std::os::raw::c_char,
    pub sg_passwd: *mut ::std::os::raw::c_char,
    pub sg_adm: *mut *mut ::std::os::raw::c_char,
    pub sg_mem: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_sgrp() {
    const UNINIT: ::std::mem::MaybeUninit<sgrp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sgrp>(),
        32usize,
        concat!("Size of: ", stringify!(sgrp))
    );
    assert_eq!(
        ::std::mem::align_of::<sgrp>(),
        8usize,
        concat!("Alignment of ", stringify!(sgrp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sg_namp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sgrp),
            "::",
            stringify!(sg_namp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sg_passwd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sgrp),
            "::",
            stringify!(sg_passwd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sg_adm) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sgrp),
            "::",
            stringify!(sg_adm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sg_mem) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sgrp),
            "::",
            stringify!(sg_mem)
        )
    );
}
pub type iconv_t = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    const UNINIT: ::std::mem::MaybeUninit<iovec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = ::std::os::raw::c_uint;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_storage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_padding) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_align) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
}
pub const MSG_OOB: _bindgen_ty_12 = 1;
pub const MSG_PEEK: _bindgen_ty_12 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_12 = 4;
pub const MSG_CTRUNC: _bindgen_ty_12 = 8;
pub const MSG_PROXY: _bindgen_ty_12 = 16;
pub const MSG_TRUNC: _bindgen_ty_12 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_12 = 64;
pub const MSG_EOR: _bindgen_ty_12 = 128;
pub const MSG_WAITALL: _bindgen_ty_12 = 256;
pub const MSG_FIN: _bindgen_ty_12 = 512;
pub const MSG_SYN: _bindgen_ty_12 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_12 = 2048;
pub const MSG_RST: _bindgen_ty_12 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_12 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_12 = 16384;
pub const MSG_MORE: _bindgen_ty_12 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_12 = 65536;
pub const MSG_BATCH: _bindgen_ty_12 = 262144;
pub const MSG_ZEROCOPY: _bindgen_ty_12 = 67108864;
pub const MSG_FASTOPEN: _bindgen_ty_12 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_12 = 1073741824;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        56usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_namelen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iovlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_control) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_control)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_controllen) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<cmsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        16usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_level) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_type) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cmsg_data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(__cmsg_data)
        )
    );
}
pub const SCM_RIGHTS: _bindgen_ty_13 = 1;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_old_dev_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    const UNINIT: ::std::mem::MaybeUninit<linger> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<linger>(),
        8usize,
        concat!("Size of: ", stringify!(linger))
    );
    assert_eq!(
        ::std::mem::align_of::<linger>(),
        4usize,
        concat!("Alignment of ", stringify!(linger))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_onoff) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_onoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_linger) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_linger)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<osockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<osockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(osockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<osockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(osockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
pub const SHUT_RD: _bindgen_ty_14 = 0;
pub const SHUT_WR: _bindgen_ty_14 = 1;
pub const SHUT_RDWR: _bindgen_ty_14 = 2;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifaddrs {
    pub ifa_next: *mut ifaddrs,
    pub ifa_name: *mut ::std::os::raw::c_char,
    pub ifa_flags: ::std::os::raw::c_uint,
    pub ifa_addr: *mut sockaddr,
    pub ifa_netmask: *mut sockaddr,
    pub ifa_ifu: ifaddrs__bindgen_ty_1,
    pub ifa_data: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifaddrs__bindgen_ty_1 {
    pub ifu_broadaddr: *mut sockaddr,
    pub ifu_dstaddr: *mut sockaddr,
}
#[test]
fn bindgen_test_layout_ifaddrs__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifaddrs__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifaddrs__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ifaddrs__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifaddrs__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ifaddrs__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifu_broadaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs__bindgen_ty_1),
            "::",
            stringify!(ifu_broadaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifu_dstaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs__bindgen_ty_1),
            "::",
            stringify!(ifu_dstaddr)
        )
    );
}
#[test]
fn bindgen_test_layout_ifaddrs() {
    const UNINIT: ::std::mem::MaybeUninit<ifaddrs> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifaddrs>(),
        56usize,
        concat!("Size of: ", stringify!(ifaddrs))
    );
    assert_eq!(
        ::std::mem::align_of::<ifaddrs>(),
        8usize,
        concat!("Alignment of ", stringify!(ifaddrs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_addr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_netmask) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_netmask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_ifu) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_ifu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_data) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_data)
        )
    );
}
pub type __gwchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<imaxdiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type nl_catd = *mut ::std::os::raw::c_void;
pub type nl_item = ::std::os::raw::c_int;
pub const ABDAY_1: _bindgen_ty_15 = 131072;
pub const ABDAY_2: _bindgen_ty_15 = 131073;
pub const ABDAY_3: _bindgen_ty_15 = 131074;
pub const ABDAY_4: _bindgen_ty_15 = 131075;
pub const ABDAY_5: _bindgen_ty_15 = 131076;
pub const ABDAY_6: _bindgen_ty_15 = 131077;
pub const ABDAY_7: _bindgen_ty_15 = 131078;
pub const DAY_1: _bindgen_ty_15 = 131079;
pub const DAY_2: _bindgen_ty_15 = 131080;
pub const DAY_3: _bindgen_ty_15 = 131081;
pub const DAY_4: _bindgen_ty_15 = 131082;
pub const DAY_5: _bindgen_ty_15 = 131083;
pub const DAY_6: _bindgen_ty_15 = 131084;
pub const DAY_7: _bindgen_ty_15 = 131085;
pub const ABMON_1: _bindgen_ty_15 = 131086;
pub const ABMON_2: _bindgen_ty_15 = 131087;
pub const ABMON_3: _bindgen_ty_15 = 131088;
pub const ABMON_4: _bindgen_ty_15 = 131089;
pub const ABMON_5: _bindgen_ty_15 = 131090;
pub const ABMON_6: _bindgen_ty_15 = 131091;
pub const ABMON_7: _bindgen_ty_15 = 131092;
pub const ABMON_8: _bindgen_ty_15 = 131093;
pub const ABMON_9: _bindgen_ty_15 = 131094;
pub const ABMON_10: _bindgen_ty_15 = 131095;
pub const ABMON_11: _bindgen_ty_15 = 131096;
pub const ABMON_12: _bindgen_ty_15 = 131097;
pub const MON_1: _bindgen_ty_15 = 131098;
pub const MON_2: _bindgen_ty_15 = 131099;
pub const MON_3: _bindgen_ty_15 = 131100;
pub const MON_4: _bindgen_ty_15 = 131101;
pub const MON_5: _bindgen_ty_15 = 131102;
pub const MON_6: _bindgen_ty_15 = 131103;
pub const MON_7: _bindgen_ty_15 = 131104;
pub const MON_8: _bindgen_ty_15 = 131105;
pub const MON_9: _bindgen_ty_15 = 131106;
pub const MON_10: _bindgen_ty_15 = 131107;
pub const MON_11: _bindgen_ty_15 = 131108;
pub const MON_12: _bindgen_ty_15 = 131109;
pub const AM_STR: _bindgen_ty_15 = 131110;
pub const PM_STR: _bindgen_ty_15 = 131111;
pub const D_T_FMT: _bindgen_ty_15 = 131112;
pub const D_FMT: _bindgen_ty_15 = 131113;
pub const T_FMT: _bindgen_ty_15 = 131114;
pub const T_FMT_AMPM: _bindgen_ty_15 = 131115;
pub const ERA: _bindgen_ty_15 = 131116;
pub const __ERA_YEAR: _bindgen_ty_15 = 131117;
pub const ERA_D_FMT: _bindgen_ty_15 = 131118;
pub const ALT_DIGITS: _bindgen_ty_15 = 131119;
pub const ERA_D_T_FMT: _bindgen_ty_15 = 131120;
pub const ERA_T_FMT: _bindgen_ty_15 = 131121;
pub const _NL_TIME_ERA_NUM_ENTRIES: _bindgen_ty_15 = 131122;
pub const _NL_TIME_ERA_ENTRIES: _bindgen_ty_15 = 131123;
pub const _NL_WABDAY_1: _bindgen_ty_15 = 131124;
pub const _NL_WABDAY_2: _bindgen_ty_15 = 131125;
pub const _NL_WABDAY_3: _bindgen_ty_15 = 131126;
pub const _NL_WABDAY_4: _bindgen_ty_15 = 131127;
pub const _NL_WABDAY_5: _bindgen_ty_15 = 131128;
pub const _NL_WABDAY_6: _bindgen_ty_15 = 131129;
pub const _NL_WABDAY_7: _bindgen_ty_15 = 131130;
pub const _NL_WDAY_1: _bindgen_ty_15 = 131131;
pub const _NL_WDAY_2: _bindgen_ty_15 = 131132;
pub const _NL_WDAY_3: _bindgen_ty_15 = 131133;
pub const _NL_WDAY_4: _bindgen_ty_15 = 131134;
pub const _NL_WDAY_5: _bindgen_ty_15 = 131135;
pub const _NL_WDAY_6: _bindgen_ty_15 = 131136;
pub const _NL_WDAY_7: _bindgen_ty_15 = 131137;
pub const _NL_WABMON_1: _bindgen_ty_15 = 131138;
pub const _NL_WABMON_2: _bindgen_ty_15 = 131139;
pub const _NL_WABMON_3: _bindgen_ty_15 = 131140;
pub const _NL_WABMON_4: _bindgen_ty_15 = 131141;
pub const _NL_WABMON_5: _bindgen_ty_15 = 131142;
pub const _NL_WABMON_6: _bindgen_ty_15 = 131143;
pub const _NL_WABMON_7: _bindgen_ty_15 = 131144;
pub const _NL_WABMON_8: _bindgen_ty_15 = 131145;
pub const _NL_WABMON_9: _bindgen_ty_15 = 131146;
pub const _NL_WABMON_10: _bindgen_ty_15 = 131147;
pub const _NL_WABMON_11: _bindgen_ty_15 = 131148;
pub const _NL_WABMON_12: _bindgen_ty_15 = 131149;
pub const _NL_WMON_1: _bindgen_ty_15 = 131150;
pub const _NL_WMON_2: _bindgen_ty_15 = 131151;
pub const _NL_WMON_3: _bindgen_ty_15 = 131152;
pub const _NL_WMON_4: _bindgen_ty_15 = 131153;
pub const _NL_WMON_5: _bindgen_ty_15 = 131154;
pub const _NL_WMON_6: _bindgen_ty_15 = 131155;
pub const _NL_WMON_7: _bindgen_ty_15 = 131156;
pub const _NL_WMON_8: _bindgen_ty_15 = 131157;
pub const _NL_WMON_9: _bindgen_ty_15 = 131158;
pub const _NL_WMON_10: _bindgen_ty_15 = 131159;
pub const _NL_WMON_11: _bindgen_ty_15 = 131160;
pub const _NL_WMON_12: _bindgen_ty_15 = 131161;
pub const _NL_WAM_STR: _bindgen_ty_15 = 131162;
pub const _NL_WPM_STR: _bindgen_ty_15 = 131163;
pub const _NL_WD_T_FMT: _bindgen_ty_15 = 131164;
pub const _NL_WD_FMT: _bindgen_ty_15 = 131165;
pub const _NL_WT_FMT: _bindgen_ty_15 = 131166;
pub const _NL_WT_FMT_AMPM: _bindgen_ty_15 = 131167;
pub const _NL_WERA_YEAR: _bindgen_ty_15 = 131168;
pub const _NL_WERA_D_FMT: _bindgen_ty_15 = 131169;
pub const _NL_WALT_DIGITS: _bindgen_ty_15 = 131170;
pub const _NL_WERA_D_T_FMT: _bindgen_ty_15 = 131171;
pub const _NL_WERA_T_FMT: _bindgen_ty_15 = 131172;
pub const _NL_TIME_WEEK_NDAYS: _bindgen_ty_15 = 131173;
pub const _NL_TIME_WEEK_1STDAY: _bindgen_ty_15 = 131174;
pub const _NL_TIME_WEEK_1STWEEK: _bindgen_ty_15 = 131175;
pub const _NL_TIME_FIRST_WEEKDAY: _bindgen_ty_15 = 131176;
pub const _NL_TIME_FIRST_WORKDAY: _bindgen_ty_15 = 131177;
pub const _NL_TIME_CAL_DIRECTION: _bindgen_ty_15 = 131178;
pub const _NL_TIME_TIMEZONE: _bindgen_ty_15 = 131179;
pub const _DATE_FMT: _bindgen_ty_15 = 131180;
pub const _NL_W_DATE_FMT: _bindgen_ty_15 = 131181;
pub const _NL_TIME_CODESET: _bindgen_ty_15 = 131182;
pub const __ALTMON_1: _bindgen_ty_15 = 131183;
pub const __ALTMON_2: _bindgen_ty_15 = 131184;
pub const __ALTMON_3: _bindgen_ty_15 = 131185;
pub const __ALTMON_4: _bindgen_ty_15 = 131186;
pub const __ALTMON_5: _bindgen_ty_15 = 131187;
pub const __ALTMON_6: _bindgen_ty_15 = 131188;
pub const __ALTMON_7: _bindgen_ty_15 = 131189;
pub const __ALTMON_8: _bindgen_ty_15 = 131190;
pub const __ALTMON_9: _bindgen_ty_15 = 131191;
pub const __ALTMON_10: _bindgen_ty_15 = 131192;
pub const __ALTMON_11: _bindgen_ty_15 = 131193;
pub const __ALTMON_12: _bindgen_ty_15 = 131194;
pub const _NL_WALTMON_1: _bindgen_ty_15 = 131195;
pub const _NL_WALTMON_2: _bindgen_ty_15 = 131196;
pub const _NL_WALTMON_3: _bindgen_ty_15 = 131197;
pub const _NL_WALTMON_4: _bindgen_ty_15 = 131198;
pub const _NL_WALTMON_5: _bindgen_ty_15 = 131199;
